<a href="https://colab.research.google.com/github/niuhaoyu16/Pandas-Examples/blob/master/PandasExamples1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#For tutorial only

In [0]:
import pandas as pd
pd.Series?

In [2]:
animals = ['tiger','bear','moose']
pd.Series(animals)

0    tiger
1     bear
2    moose
dtype: object

In [3]:
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [4]:
animals = ['tiger', 'bear', None]
pd.Series(animals)

0    tiger
1     bear
2     None
dtype: object

In [6]:
numbers = [1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
import numpy as np
np.nan ==None

False

In [8]:
np.nan ==np.nan

False

In [9]:
np.isnan(np.nan)

True

In [10]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [11]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [12]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [13]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

In [14]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [15]:
s.iloc[3]

'South Korea'

In [16]:
s.loc['Golf']

'Scotland'

In [17]:
s[3]

'South Korea'

In [18]:
s['Golf']

'Scotland'

In [0]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)

In [20]:
s[0]

KeyError: ignored

In [21]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [22]:
total =0
for item in s:
  total+=item
print(total)

324.0

In [23]:
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0    944
1    515
2    536
3    289
4     57
dtype: int64

In [24]:
len(s)

10000

In [26]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['store 1', 'store 1', 'store 2'])
df.head()

          Name Item Purchased  Cost
store 1  Chris       Dog Food  22.5
store 1  Kevyn   Kitty Litter   2.5
store 2  Vinod      Bird Seed   5.0

In [27]:
df.loc['store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: store 2, dtype: object

In [29]:
type(df.loc['store 2'])

pandas.core.series.Series

In [30]:
df.loc['store 1']

          Name Item Purchased  Cost
store 1  Chris       Dog Food  22.5
store 1  Kevyn   Kitty Litter   2.5

In [31]:
df.loc['store 1', 'Cost']

store 1    22.5
store 1     2.5
Name: Cost, dtype: float64

In [32]:
df.T

                 store 1       store 1    store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [33]:
df.T.loc['Cost']

store 1    22.5
store 1     2.5
store 2       5
Name: Cost, dtype: object

In [34]:
df['Cost']

store 1    22.5
store 1     2.5
store 2     5.0
Name: Cost, dtype: float64

In [35]:
df

          Name Item Purchased  Cost
store 1  Chris       Dog Food  22.5
store 1  Kevyn   Kitty Litter   2.5
store 2  Vinod      Bird Seed   5.0

In [36]:
df.loc['store 1']['Cost']

store 1    22.5
store 1     2.5
Name: Cost, dtype: float64

In [37]:
df.loc['store 1', 'Cost']

store 1    22.5
store 1     2.5
Name: Cost, dtype: float64

In [38]:
df.loc[:,['Name', 'Cost']]

          Name  Cost
store 1  Chris  22.5
store 1  Kevyn   2.5
store 2  Vinod   5.0

In [39]:
df

          Name Item Purchased  Cost
store 1  Chris       Dog Food  22.5
store 1  Kevyn   Kitty Litter   2.5
store 2  Vinod      Bird Seed   5.0

In [40]:
df.drop('store 1')

          Name Item Purchased  Cost
store 2  Vinod      Bird Seed   5.0

In [41]:
df

          Name Item Purchased  Cost
store 1  Chris       Dog Food  22.5
store 1  Kevyn   Kitty Litter   2.5
store 2  Vinod      Bird Seed   5.0

In [43]:
df_copy = df.copy()
df_copy = df_copy.drop('store 1')
df_copy

          Name Item Purchased  Cost
store 2  Vinod      Bird Seed   5.0

In [44]:
df

          Name Item Purchased  Cost
store 1  Chris       Dog Food  22.5
store 1  Kevyn   Kitty Litter   2.5
store 2  Vinod      Bird Seed   5.0

In [45]:
df_copy

          Name Item Purchased  Cost
store 2  Vinod      Bird Seed   5.0

In [0]:
del df_copy['Name']

In [47]:
df_copy

        Item Purchased  Cost
store 2      Bird Seed   5.0

In [0]:
df['Location'] = None

In [49]:
df

          Name Item Purchased  Cost Location
store 1  Chris       Dog Food  22.5     None
store 1  Kevyn   Kitty Litter   2.5     None
store 2  Vinod      Bird Seed   5.0     None

In [0]:
costs = df['Cost']

In [51]:
costs

store 1    22.5
store 1     2.5
store 2     5.0
Name: Cost, dtype: float64

In [0]:
costs +=2

In [53]:
costs

store 1    24.5
store 1     4.5
store 2     7.0
Name: Cost, dtype: float64

In [54]:
df

          Name Item Purchased  Cost Location
store 1  Chris       Dog Food  24.5     None
store 1  Kevyn   Kitty Litter   4.5     None
store 2  Vinod      Bird Seed   7.0     None